ГрумингСалон/Tasks/ЗадачиИсполнителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Task>
		<Properties>
			<Name>ЗадачиИсполнителя</Name>
			<Addressing>InformationRegister.РегистрАдресации</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоСогласие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

ГрумингСалон/Tasks/ЗадачиИсполнителя/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Предмет = Задачи.ЗадачиИсполнителя.ВозвратПредмет(Объект.БизнесПроцесс);
	Объект.Наименование = "Получить согласие клиента " + Объект.Предмет + "на регистрацию";
	Объект.ОписаниеЗадачи = "Из мобильного приложения поступила заявка на регистрацию пользователя.
	| Необходимо созваниться с клиентом " + Объект.Предмет + " по телефону " + Задачи.ЗадачиИсполнителя.ВозвратТелефон(Объект.БизнесПроцесс) + " и получить согласие на регистрацию, а так же дозополнить карточку клиента - ФИО, Дату рождения, сведения о питомцах и другие данные, которые клиент согласен предоставить.";
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКартуМаршрута(Команда)
	
	КартаМаршрута = ОткрытьФорму("БизнесПроцесс.ДорегистрацияПользователя.Форма.КартаМаршрута");
	КартаМаршрута.БизнесПроцесс = Объект.БизнесПроцесс; 
	
КонецПроцедуры
